In [47]:
import pandas as pd
import numpy as np

In [26]:
data = {
    "state": ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    "year": [2000, 2001, 2002, 2001, 2002, 2003],
    "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

In [27]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [28]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [29]:
frame1 = pd.DataFrame(data, columns=['year','state','pop'])
frame1

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [ ]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])  #debt will have NaN values
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [34]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [35]:
frame2.iloc[3]

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

In [36]:
del frame2['debt']
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [38]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [ ]:
frame2.debt = 21   #broadcasting
frame2['hi'] = 20
frame2.hello = 5   #does not work
frame2

       year   state  pop  debt  hi
one    2000    Ohio  1.5    21  20
two    2001    Ohio  1.7    21  20
three  2002    Ohio  3.6    21  20
four   2001  Nevada  2.4    21  20
five   2002  Nevada  2.9    21  20
six    2003  Nevada  3.2    21  20

In [55]:
frame2['debt'] = np.arange(6.)   #should be same as the number of rows, otherwise error
frame2

       year   state  pop  debt  hi
one    2000    Ohio  1.5   0.0  20
two    2001    Ohio  1.7   1.0  20
three  2002    Ohio  3.6   2.0  20
four   2001  Nevada  2.4   3.0  20
five   2002  Nevada  2.9   4.0  20
six    2003  Nevada  3.2   5.0  20

Assigning series to dataframe

In [ ]:
val = pd.Series([-1.2,-1.5, -1.7], index=['two','four','five'])   #remaining non mentioned indexes will become NaN
frame2['debt'] = val
frame2

       year   state  pop  debt  hi
one    2000    Ohio  1.5   NaN  20
two    2001    Ohio  1.7  -1.2  20
three  2002    Ohio  3.6   NaN  20
four   2001  Nevada  2.4  -1.5  20
five   2002  Nevada  2.9  -1.7  20
six    2003  Nevada  3.2   NaN  20

In [ ]:
frame2['eastern'] = frame2.state == 'Ohio'
#frame2['ria']       #this is will error
frame2['ria'] = 5   #value needs to be given when initialized
frame2

       year   state  pop  debt  hi  eastern  ria
one    2000    Ohio  1.5   NaN  20     True    5
two    2001    Ohio  1.7  -1.2  20     True    5
three  2002    Ohio  3.6   NaN  20     True    5
four   2001  Nevada  2.4  -1.5  20    False    5
five   2002  Nevada  2.9  -1.7  20    False    5
six    2003  Nevada  3.2   NaN  20    False    5

In [62]:
pop = {'Nevada': {2001:2.4, 2002:2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5